from nonebot import on_keyword, on_fullmatch
from nonebot.adapters.onebot.v11 import Message , MessageSegment
import nonebot

config = nonebot.get_driver().config
files = config.files

bak = on_fullmatch("基础知识")
# sd = on_fullmatch({"什么是速度"})
# xzb = on_fullmatch({"修正比", "什么是修正比"})
# ny = on_fullmatch({"什么是碾压等级", "什么是被碾压等级"})
# jjbj = on_fullmatch({"什么是警戒半径"})
# qwbj = on_fullmatch({"什么是清雾半径"})
# jzsc = on_fullmatch({"什么是建造/训练时长", "什么是建造时长", "什么是训练时长"})
# jzwx = on_fullmatch({"什么是建筑维修"})
# khsj = on_fullmatch({"什么是一轮开火时间"})
# scsh = on_fullmatch({"什么是一轮输出伤害"})
# DPS = on_fullmatch({"什么是DPS"})
# jsbj = on_fullmatch({"什么是溅射半径"})
# jssh = on_fullmatch({"什么是溅射伤害"})
# bjyz = on_fullmatch({"什么是步兵压制"})
# hjlx = on_fullmatch({"什么是护甲类型"})
# bbjz = on_fullmatch({"什么是步兵进驻"})
# dwsj = on_fullmatch({"什么是单位升级后的数值变化"})
# ldsh = on_fullmatch({"什么是冷冻伤害"})
# sycl = on_fullmatch({"什么是视野残留机制"})
#
#
@bak.handle()
async def _():
    await bak.finish(MessageSegment.image( f'file://{files}/image/bk.png'))
# @xzb.handle()
# async def _():
#     await xzb.finish(MessageSegment.text(
#         "------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n修正比：同一护甲类型的不同单位和建筑修正比相同。 所谓修正比,可理解为相应伤害所造成的倍数。 如对高爆修正比200%就是受到高爆伤害时,实际伤害值会变成基础伤害值的2倍；对机炮修正比50%就是受到机炮伤害时,实际伤害值会变成基础伤害值的一半。 主要有以下伤害类型会受到修正比的影响：肉搏、狙击、枪弹、机炮、破片、火箭、穿甲、光谱、电击、高爆、榴弹、鱼雷、冲击、镭射。 另外，地面/水面载具侧面受到105%的伤害，背面受到110%的伤害，少部分其他单位也有特殊侧面加伤或背面加上，将在其对应数据表中注明。\n------------------------------"))
#
#
# @sd.handle()
# async def _():
#     await sd.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n速度：载具及舰船红血或倒退移动时速度变为75%\n------------------------------"))
#
#
# @ny.handle()
# async def _():
#     await ny.finish(MessageSegment.text(
#         "------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n碾压等级和被碾压等级:发生碾压行为的时候，简单来说是因为碾压方的碾压等级大于被碾压方的被碾压等级\n------------------------------"))
#
#
# @jjbj.handle()
# async def _():
#     await jjbj.finish(
#         MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n警戒半径:当该范围内出现敌军时，你的单位就会准备对其开火（表现为武器朝向敌军方向）\n------------------------------"))
#
#
# @qwbj.handle()
# async def _():
#     await qwbj.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n清雾半径:即获取的视野范围\n------------------------------"))
#
#
# @jzsc.handle()
# async def _():
#     await jzsc.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n建造/训练时长：电力不足时，视情况建造/训练的速度降至30%~50%，如果电量完全为0则建造/训练速度增加3.1倍\n------------------------------"))
#
#
# @jzwx.handle()
# async def _():
#     await jzwx.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n建筑维修：每秒修复10点血量的损伤，花费根据所剩余血量最多为建筑造价的50%\n------------------------------"))
#
#
# @khsj.handle()
# async def _():
#     await khsj.finish(MessageSegment.text(
#         "------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n一轮开火时间≈攻击瞄准时间+开火持续时间x弹夹大小+弹夹装填时间。（约等于由于RA3游戏的特殊原因，一些小于0.5s的时间会变成无理数。）部分单位的武器不遵守这个通则（如标枪技能对单一目标不需要反复瞄准），会特别注明\n------------------------------"))
#
#
# @scsh.handle()
# async def _():
#     await scsh.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n一轮输出伤害=单发伤害x弹夹大小\n------------------------------"))
#
#
# @DPS.handle()
# async def _():
#     await DPS.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\nDPS=一轮输出伤害÷一轮开火时间\n------------------------------"))
#
#
# @jsbj.handle()
# async def _():
#     await jsbj.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n溅射半径：所谓的AOE或者说片伤能影响到的范围\n------------------------------"))
#
#
# @jssh.handle()
# async def _():
#     await jssh.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n伤害类型：决定触发目标护甲中的哪项修正比，如目标单位护甲对火箭修正比为10%，那么火箭伤害类型的伤害对该单位只能造成10%的伤害\n------------------------------"))
#
#
# @bjyz.handle()
# async def _():
#     await bjyz.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n步兵压制：压制作用于任何步兵，不包括警犬、战熊、火箭天使、谭雅、百合子、娜塔莎、百合子本尊。各步兵的抗压值为50，星级后为300，使用防暴盾牌、万岁冲锋、急奔时为99999，武器中的压制模块使该单位压制值超过抗压值时，为该单位添加匍匐效果，在此状态下移动时为该单位添加匍匐移动效果。匍匐时步兵护甲修正比参数乘上75%，速度参数乘上75%，匍匐移动时，护甲修正比参数再乘上125%（相当于原值的93.75%）\n------------------------------"))
#
#
# @hjlx.handle()
# async def _():
#     await hjlx.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n护甲类型： RA3的单位和建筑拥有许多护甲类型,每种护甲类型对各种伤害类型有不同的修正比，RA3不分轻重甲。\n------------------------------"))
#
#
# @bbjz.handle()
# async def _():
#     await bbjz.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n步兵进驻建筑后的数值变化：警戒半径乘上250%，攻击射程乘上175%\n------------------------------"))
#
#
# @dwsj.handle()
# async def _():
#     await dwsj.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n单位升级后的数值变化：一级后单发伤害乘上125% 二级后生命值乘上125% 星级后警戒半径乘上125%，清雾半径乘上125%，攻击射程乘上125%，星级后开火速率乘上120% 幻影和天启升至星级后还会完全更换武器 星级的步兵在脱离战斗后每秒回血2 星级的载具在脱离战斗后每秒回血6 脱离战斗的判定为不进行攻击与不被攻击1秒后\n------------------------------"))
#
#
# @ldsh.handle()
# async def _():
#     await ldsh.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n冷冻伤害：方便理解，有一个冷冻血条，为基础生命上限的200%，处于被冷冻攻击时会减少，每减少20%，目标单位的速度、射速或者目标建筑的生产速度便减少20%。冷冻血条低于100%时，目标就会被冻住，变为冰冻状态。爆裂机械人被冰冻后会直接死亡。当物体不受到冷冻伤害时，冷冻血条每秒回复25，直至完全回复。\n------------------------------"))
#
#
# @sycl.handle()
# async def _():
#     await sycl.finish(MessageSegment.text("------------------------------\n如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n并且请联系维基百科编写人员，因为机器人百科是维基百科上扒下来的。\n------------------------------\n视野残留机制：当单位死亡后会保存5秒钟的视野，随后3秒内视野慢慢消失成为战争迷雾\n------------------------------"))
#

