# 血量列表
from nonebot import on_keyword, on_fullmatch
from nonebot.adapters.onebot.v11 import Message , MessageSegment

sldw = on_fullmatch({"苏联单位血量"})
sljz = on_fullmatch({"苏联建筑血量"})
mjdw = on_fullmatch({"盟军单位血量"})
mjjz = on_fullmatch({"盟军建筑血量"})
sydw = on_fullmatch({"升阳/帝国单位血量", "升阳单位血量", "帝国单位血量"})
syjz = on_fullmatch({"升阳/帝国建筑血量", "升阳建筑血量", "帝国建筑血量"})


@sldw.handle()
async def _():
    await sldw.finish(Message(
        "-------------------------" + "\n" + "如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n来源与百科与百度" + "\n" + "修正比请参照百科：https://wiki.biligame.com/redalert3/%E9%A6%96%E9%A1%B5" + "\n" + "-------------------------" + "\n" + "战熊：150" + "\n" + "动员兵：100" + "\n" + "防空步兵：100" + "\n" + "战斗工兵：50" + "\n" + "磁暴部队：200" + "\n" + "娜塔莎：300" + "\n" + "苏联矿车：500" + "\n" + "史普尼克勘探车：500" + "\n" + "恐怖机器人：50" + "\n" + "镰刀机甲：450" + "\n" + "牛蛙：300" + "\n" + "铁锤坦克：550" + "\n" + "磁暴坦克：750" + "\n" + "V4导弹发射车：400" + "\n" + "天启坦克：3000" + "\n" + "双刃直升机：500" + "\n" + "米格战斗机：240" + "\n" + "基洛夫飞艇：6000" + "\n" + "磁暴快艇：450" + "\n" + "阿库拉潜艇：1250" + "\n" + "无畏战列舰：1500" + "\n" + "苏联基地车：5000" + "\n" + "-------------------------"))


@sljz.handle()
async def _():
    await sljz.finish(Message(
        "-------------------------" + "\n" + "如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n来源与百科与百度" + "\n" + "修正比请参照百科：https://wiki.biligame.com/redalert3/%E9%A6%96%E9%A1%B5" + "\n" + "-------------------------" + "\n" + "苏联建造场：5000" + "\n" + "反应堆：1000" + "\n" + "军营：1250" + "\n" + "苏联矿石精炼厂：2500" + "\n" + "战争工厂：3200" + "\n" + "海军造船厂：3200" + "\n" + "机场：1800" + "\n" + "超级反应堆：4000" + "\n" + "作战实验室：2000" + "\n" + "压碎起重机：1500" + "\n" + "苏联围墙：300" + "\n" + "哨兵枪：625" + "\n" + "防空炮：2000" + "\n" + "磁暴线圈：2000" + "\n" + "铁幕装置：5000" + "\n" + "真空内爆弹：5000" + "\n" + "战斗碉堡：1500" + "\n" + "前线基地：500" + "\n" + "-------------------------"))


@mjdw.handle()
async def _():
    await mjdw.finish(Message(
        "-------------------------" + "\n" + "如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n来源与百科与百度" + "\n" + "修正比请参照百科：https://wiki.biligame.com/redalert3/%E9%A6%96%E9%A1%B5" + "\n" + "-------------------------" + "\n" + "警犬：30" + "\n" + "维和步兵：150" + "\n" + "标枪兵：100" + "\n" + "工程师：50" + "\n" + "间谍：75" + "\n" + "谭雅：300" + "\n" + "勘探者：500" + "\n" + "激流ACV：500" + "\n" + "多功能步兵车：360" + "\n" + "守护者坦克：480" + "\n" + "雅典娜炮：400" + "\n" + "幻影坦克：500" + "\n" + "海豚：300" + "\n" + "水翼船：400" + "\n" + "突袭驱逐舰：1200" + "\n" + "航空母舰：1500" + "\n" + "维和轰炸机：350/437.5" + "\n" + "阿波罗战斗机：300/375" + "\n" + "冰冻直升机：650/812.5" + "\n" + "世纪轰炸机：1000/1250" + "\n" + "盟军基地车：5000" + "\n" + "-------------------------"))


@mjjz.handle()
async def _():
    await mjjz.finish(Message(
        "-------------------------" + "\n" + "如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n来源与百科与百度" + "\n" + "修正比请参照百科：https://wiki.biligame.com/redalert3/%E9%A6%96%E9%A1%B5" + "\n" + "-------------------------" + "\n" + "盟军建造场：4000" + "\n" + "发电厂：1000" + "\n" + "新兵训练营：1000" + "\n" + "盟军矿石精炼厂：2000" + "\n" + "装甲工厂：2500" + "\n" + "海港：2500" + "\n" + "空军基地：2000" + "\n" + "科技中心：2000" + "\n" +  "盟军围墙：300" + "\n" + "多功能炮塔：1000" + "\n" + "光谱塔：1500" + "\n" + "超时空传送：4000" + "\n" + "质子撞击炮：4000" + "\n" + "指挥中心：2000" + "\n" + "-------------------------"))


@sydw.handle()
async def _():
    await sydw.finish(Message(
        "-------------------------" + "\n" + "如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n来源与百科与百度" + "\n" + "修正比请参照百科：https://wiki.biligame.com/redalert3/%E9%A6%96%E9%A1%B5" + "\n" + "-------------------------" + "\n" + "爆裂机器人：100" + "\n" + "帝国武士：160" + "\n" + "坦克杀手：100" + "\n" + "工兵：50" + "\n" + "忍者：200" + "\n" + "火箭天使：400" + "\n" + "欧米茄百合子：350" + "\n" + "帝国矿车：500" + "\n" + "迅雷运输艇：400" + "\n" + "天狗机甲：350" + "\n" + "打击者-VX：400" + "\n" + "海啸坦克：380" + "\n" + "鬼王：3000" + "\n" + "波能坦克：500" + "\n" + "长枪迷你潜艇：400" + "\n" + "海翼：400" + "\n" + "薙刀巡洋舰：1200" + "\n" + "将军战列舰：1500" + "\n" + "帝国基地车：5000" + "\n" + "-------------------------"))


@syjz.handle()
async def _():
    await syjz.finish(Message(
        "-------------------------" + "\n" + "如果有误请写出正确的信息并联系玖渚智心（Kunagisa Chitekina kokoro）：1549184870\n来源与百科与百度" + "\n" + "修正比请参照百科：https://wiki.biligame.com/redalert3/%E9%A6%96%E9%A1%B5" + "\n" + "-------------------------" + "\n" + "帝国建造场：4000" + "\n" + "瞬息发电厂：1250" + "\n" + "瞬息道场：1000" + "\n" + "帝国矿石精炼厂：2000" + "\n" + "机甲工厂：2500" + "\n" + "帝国码头：2500" + "\n" + "纳米主机：2000" + "\n" + "帝国围墙：300" + "\n" + "防卫者—VX：1000" + "\n" + "波能塔：1500" + "\n" + "纳米虫群：4000" + "\n" + "超能波毁灭：4000" + "\n" + "纳米核心：400" + "\n" + "-------------------------"))
